{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.9/4.0"
      ],
      "degree": "Software Engineering Immersive",
      "department": "Faculty of Computing",
      "duration": "2022-2022",
      "school_name": "General Assembly"
    },
    {
      "awards_achievements": [
        "This thesis creates a new method for dictionary of cued recall based graphical password by combination of top down and bottom visual attention. This approach leads to powerful automated dictionary attack that can guess up to 70% of some passwords."
      ],
      "degree": "PHD of Computer Science",
      "department": "Faculty of Computing",
      "duration": "2010-2015",
      "school_name": "Universiti Teknologi Malaysia"
    },
    {
      "awards_achievements": [
        "GPA: 3.65/4.0",
        "This thesis is an Enhancement on Passface Graphical Password Authentication."
      ],
      "degree": "Master of Computer Science (Information Security)",
      "department": "Faculty of Computing",
      "duration": "2008-2010",
      "school_name": "Universiti Teknologi Malaysia"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-FarnazTowhidi",
  "highlighted_projects": [
    {
      "description": "Solo, 1 week project for DRY REST API of fully-functional styled inventory application. Technologies used, Express/Node and MongoDB, Python.",
      "git_url": "https://github.com/FarnazTowhidi/macDonald",
      "name": "McDonald's Application"
    },
    {
      "description": "Group of 4 developers creates a MERN stack application, a responsive single page application. Uploader with the use of AWS S3 buckets and the npm package, \"aws-sdk\". Technologies used, MongoDB, Express, React, Socket.io, Amazon Web Services.",
      "git_url": "https://github.com/FarnazTowhidi/mern-project",
      "name": "Chatterbox"
    },
    {
      "description": "Group of 5 developers creates a full crud application in 1 week, for recording the user's daily fitness log. Technologies used, HTML, CSS, Python, Django, PostreSQL.",
      "git_url": "https://github.com/aerlikh17/track-fit-app",
      "name": "Track Fit"
    },
    {
      "description": "Solo, 1 week project for the browser base game, using application state, manipulating DOM and includes shuffling and win/loss logic. Technologies used, HTML, CSS and JavaScript.",
      "git_url": "https://github.com/FarnazTowhidi/warCardGame",
      "name": "War Card Game"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project is used by the Jarvis Linux Cluster Administrator (LCA) team to manage server nodes in a closed network. The bash script collected the hardware specs of each server (hostname, CPU architecture, CPU model, and L2 cache) as well as real time resource usage (CPU idle, kernel statistics and available disk space). The PostgreSQL Docker container Configured and maintained to store and manage the collected data.To ensure accurate and up-to-date information, resource usage is fetched at regular intervals using Crontab.",
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-FarnazTowhidi/tree/develop/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Developed proficiency in data access patterns and JDBC by performing data manipulation tasks on the hplussport PostgreSQL database. Utilized Dbeaver and Intellij Idea for database management, Docker for containerization, PostgreSQL and PSQL CLI tool for database creation and manipulation, JDBC for data access, and Maven for build automation.",
      "git_url": "/core_java/jdbc",
      "name": "JDBC Apps"
    },
    {
      "description": "This project simulatered the functionality of the egrep text processing tool, enabling recursive searches of a given directory using regular expressions. The BufferedReader class is used to read the file, and regular expressions are applied to compare words against the provided regex pattern. The identified words are then saved to an output file using the FileWriter class. Additionally, the project was re-implemented using Lambda and Stream APIs to write code in a more readable functional programming style. Maven is utilized for dependency management, specifically for incorporating slf4j and log4j for logging purposes.",
      "git_url": "/core_java/grep",
      "name": "Grep App"
    },
    {
      "description": "Created a Java CRUD application that uses Twitter's REST API v2 to create and manage tweets. The user can create tweets, or delete a list of tweets by ID, all from via CLI. The app sends requests to Twitter's API through HTTP requests in the form of JSON messages, authenticated with OAuth. The architecture used follows the MVC design pattern. The build system used was Maven, and deployment was done through Docker.",
      "git_url": "/core_java/twitter",
      "name": "Twitter CRUD App"
    }
  ],
  "name": "Farnaz Towhidi",
  "others": [
    {
      "bullets": [
        "Published on Amazon: Graphical User Authentication (GUA): Graphical Password Algorithms and Analysis",
        "Published on Amazon: Graphical Password An Alternative to Textual Password",
        "Computer Hacking Forensics Investigator (CHFI), EC-Council",
        "Certified Ethical Hacker (CEH), EC-Council",
        "Cloud Core, IBM",
        "Design and User Experience (D\u0026UX), IBM"
      ],
      "title": "Licenses \u0026 Certifications"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed multiple software applications and worked on projects using Java, SQL, Linux Bash, Docker and more. Agile/Scrum was used to collaborate with team and produce minimum viable products. Git was utilized for version control on projects.",
      "duration": "2023-present",
      "title": "Technical Consultant"
    },
    {
      "company": "IBM ,Fredericton",
      "description": "Part of security intelligence team of 10 working on QRadar that ensured the testing algorithms and probability threat analysis was maintained at peak efficiency",
      "duration": "2020-2020",
      "title": "Quality Assurance"
    },
    {
      "company": "Canadian Institute of Cybersecurity, Fredericton",
      "description": "Designed and built website for International Conference on Privacy, Security and Trust,including information on events, workshops, organizers.",
      "duration": "2019-2019",
      "title": "Full Stack Developer"
    },
    {
      "company": "Biossentials, Kuala Lumpur",
      "description": "Worked closely with a designer to create and deploy a new comprehensive layout that allowed the customers to easily connect with vital information. Improved the quality of company search engine optimization performance. Overhauled the entire structure of the website, create keywords contents, change the naming of files and folder, recommended weekly content, deleting flash and other technologies to gain it",
      "duration": "2009-2014",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "REST APIs",
      "Docker",
      "Git",
      "Html/CSS",
      "Agile/Scrum"
    ],
    "familiar": [
      "OAuth",
      "TestRail",
      "Selenium",
      "Jira",
      ".Net"
    ],
    "proficient": [
      "JavaScript",
      "Java",
      "React",
      "Angular",
      "Linux bash scripting",
      "Node.js",
      "MongoDB",
      "SQL"
    ]
  },
  "summary": "I am Farnaz, a technical consultant at Jarvis Consulting Group. I completed my master's and PhD in computer science at UTM University. My research demonstrated the vulnerability of graphical password authentication to dictionary attacks by aggregation of regions within an image that exhibit low-level properties in conjunction with their neighboring regions. The result of attacking with this dictionary revealed that hot-spot are the main security flaws in graphical passwords. The findings of my research have been elegantly captured in two book available on Amazon.\""
}
